snippets/art-gtd.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-04 Sun 16:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Art of Getting things Done</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Art of Getting things Done</h1>
</header>
<div id="outline-container-org592895b" class="outline-2">
<h2 id="org592895b">GTD</h2>
<div class="outline-text-2" id="text-org592895b">
<p>
The tendency to organize things, and get the workflow in right track is a natural process, and we insist more on that in today&rsquo;s world. The mere idea of finding the &ldquo;right way&rdquo;, &ldquo;Best way possible&rdquo; is a driving opinion for various Internet opinions. People do share what works for them, and they argue.
</p>

<p>
The ultimate deal I found is, a system does not have to help you, the natural process has to help you in getting things done.
</p>

<p>
Nowadays, the system has become a hindrance in workflow, like those popular apps trying to do that thing for you.
</p>

<p>
Usually to most of the person, GTD is not organized, it just goes hand in hand like a chain and workflow is mapped into our brain.
Sure digital ecosystem has occupied and developed into a &ldquo;Second brain&rdquo; for us, but that should be too much work for <b>first brain</b> to train <span class="underline">second brain</span> to work perfectly for a system.
</p>

<p>
Just let go of the plans, just focus on what things to do for now. Slowly and gradually let your own system evolve that works perfectly for you, and there is no need to let the world know or judge about our system.
</p>

<p>
This snippet was addressed on the latest trends, and my long readings on articles and blogs over <b>Zettelkasten</b>, <b>Getting Things Done</b>, <b>Personal Knowledge Management</b> &amp; <b>Note-Taking</b>.
</p>

<p>
This would be a never ending story, and ultimately I just sat with defaults without much over thinking the system or best practice. Just go with <b>Org mode</b>, plain text file with headings defined to make sense, add <code>TODO</code> for necessary tasks, and over a month, make changes if required to make it feasible and handy for next month. This worked great, I don&rsquo;t need complexity or automation for me to see at redundant information on my notes.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<!-- <p class="date" id="content" align="left" style="font-size:0.8em;">Posted on: 2024-02-03 Sat 00:00 -->
<!--   <br> -->
<!--  Updated on: 2024-02-04 Sun 16:03 -->
<!-- </p> -->

<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
 2023 - 2024 <b>Dilip</b>  Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
